src/InformationRegisters/гр_ЖурналРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>гр_ЖурналРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимТранзакции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/гр_ЖурналРегистрацииСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗапись(ДанныеЗаписи) Экспорт
	
	#Область Предусловия
	
	гр_ОбщегоНазначенияКлиентСервер.КонтрольСоставногоПараметра(ДанныеЗаписи, "ЗаписьЖурналаРегистрации");
	
	#КонецОбласти
	
	Если ДанныеЗаписи.ВыводитьВОкноСообщений Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеЗаписи.Представление);
	КонецЕсли;
	
	Если ДанныеЗаписи.ЗаписыватьВСистемныйЖурнал Тогда
		ЗаписьЖурналаРегистрации(ДанныеЗаписи.ИмяСобытия, ДанныеЗаписи.Уровень, ДанныеЗаписи.ОбъектМетаданных, 
			ДанныеЗаписи.Данные, ДанныеЗаписи.Комментарий, ДанныеЗаписи.РежимТранзакции);
	КонецЕсли;
	
	ЗаписьЖурнала = РегистрыСведений.гр_ЖурналРегистрации.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьЖурнала, ДанныеЗаписи);
	ЗаписьЖурнала.Идентификатор = Строка(Новый УникальныйИдентификатор());
	
	Попытка
		ЗаписьЖурнала.Записать();
	Исключение
		ИсключениеПриВыполнении = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение(ИсключениеПриВыполнении);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
